project-chip/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl_WiFi.cpp
        // Alert other components of the state change.
        ChipDeviceEvent event;
        event.Type                                 = DeviceEventType::kInternetConnectivityChange;
        event.InternetConnectivityChange.IPv4      = GetConnectivityChange(hadIPv4Conn, haveIPv4Conn);
        event.InternetConnectivityChange.IPv6      = GetConnectivityChange(hadIPv6Conn, haveIPv6Conn);
        event.InternetConnectivityChange.ipAddress = addr;

        PlatformMgr().PostEventOrDie(&event);

        if (haveIPv4Conn != hadIPv4Conn)
        {
            ChipLogProgress(DeviceLayer, "%s Internet connectivity %s", "IPv4", (haveIPv4Conn) ? "ESTABLISHED" : "LOST");
        }

        if (haveIPv6Conn != hadIPv6Conn)
        {
            ChipLogProgress(DeviceLayer, "%s Internet connectivity %s", "IPv6", (haveIPv6Conn) ? "ESTABLISHED" : "LOST");
        }
    }
}

void ConnectivityManagerImpl::OnStationIPv4AddressAvailable(const ip_event_got_ip_t & got_ip)
{
#if CHIP_PROGRESS_LOGGING
    {
        ChipLogProgress(DeviceLayer, "IPv4 address %s on WiFi station interface: " IPSTR "/" IPSTR " gateway " IPSTR,
                        (got_ip.ip_changed) ? "changed" : "ready", IP2STR(&got_ip.ip_info.ip), IP2STR(&got_ip.ip_info.netmask),
                        IP2STR(&got_ip.ip_info.gw));
    }
#endif // CHIP_PROGRESS_LOGGING

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Assigned;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv4AddressLost(void)
{
    ChipLogProgress(DeviceLayer, "IPv4 address lost on WiFi station interface");

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV4_Lost;
    PlatformMgr().PostEventOrDie(&event);
}

void ConnectivityManagerImpl::OnStationIPv6AddressAvailable(const ip_event_got_ip6_t & got_ip)
{
#if CHIP_PROGRESS_LOGGING
    {
        ChipLogProgress(DeviceLayer, "IPv6 addr available. Ready on %s interface: " IPV6STR, esp_netif_get_ifkey(got_ip.esp_netif),
                        IPV62STR(got_ip.ip6_info.ip));
    }
#endif // CHIP_PROGRESS_LOGGING

    UpdateInternetConnectivityState();

    ChipDeviceEvent event;
    event.Type                           = DeviceEventType::kInterfaceIpAddressChanged;
    event.InterfaceIpAddressChanged.Type = InterfaceIpChangeType::kIpV6_Assigned;
    PlatformMgr().PostEventOrDie(&event);

#ifdef CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER
    uint8_t station_mac[6];
    if (esp_wifi_get_mac(WIFI_IF_STA, station_mac) == ESP_OK)
    {
        static chip::Inet::ESP32EndpointQueueFilter sEndpointQueueFilter;
        char station_mac_str[12];
        for (size_t i = 0; i < 6; ++i)
        {
            uint8_t dig1               = (station_mac[i] & 0xF0) >> 4;
            uint8_t dig2               = station_mac[i] & 0x0F;
            station_mac_str[2 * i]     = static_cast<char>(dig1 > 9 ? ('A' + dig1 - 0xA) : ('0' + dig1));
            station_mac_str[2 * i + 1] = static_cast<char>(dig2 > 9 ? ('A' + dig2 - 0xA) : ('0' + dig2));
        }
        if (sEndpointQueueFilter.SetMdnsHostName(chip::CharSpan(station_mac_str)) == CHIP_NO_ERROR)
        {
            chip::Inet::UDPEndPointImpl::SetQueueFilter(&sEndpointQueueFilter);
        }
        else
        {
            ChipLogError(DeviceLayer, "Failed to set mDNS hostname for endpoint queue filter");
        }
    }
    else
    {
        ChipLogError(DeviceLayer, "Failed to get the MAC address of station netif");
    }
#endif // CONFIG_ENABLE_ENDPOINT_QUEUE_FILTER

#ifdef CONFIG_ENABLE_ROUTE_HOOK
    esp_route_hook_init(esp_netif_get_handle_from_ifkey(ESP32Utils::kDefaultWiFiStationNetifKey));
#endif
}

#if CHIP_CONFIG_ENABLE_ICD_SERVER

CHIP_ERROR ConnectivityManagerImpl::_SetPollingInterval(System::Clock::Milliseconds32 pollingInterval)
{
    (void) pollingInterval;
    // For ESP32 platform, the listen interval of the legacy power-saving mode can only be configured before connecting to AP.
    return CHIP_ERROR_NOT_IMPLEMENTED;
}
#endif // CHIP_CONFIG_ENABLE_ICD_SERVER

#ifdef CONFIG_ENABLE_ESP_DIAGNOSTICS_TRACE
void ConnectivityManagerImpl::LogWiFiInfo()
{
    esp_err_t err;
    uint8_t protocol_bitmap;
    wifi_bandwidth_t bandwidth;
    wifi_ps_type_t ps_type;
    wifi_second_chan_t secondary_channel;

    // Get AP protocol
    err = esp_wifi_get_protocol(WIFI_IF_STA, &protocol_bitmap);
    if (err == ESP_OK)
    {
        const char * protocol;
        if (protocol_bitmap & WIFI_PROTOCOL_11B)
            protocol = "802.11b";
        else if (protocol_bitmap & WIFI_PROTOCOL_11G)
            protocol = "802.11g";
        else if (protocol_bitmap & WIFI_PROTOCOL_11N)
            protocol = "802.11n";
        else
            protocol = "Unknown";
        MATTER_TRACE_INSTANT("AP_protocol", protocol);
    }
    else
    {
        ESP_LOGE("LogWiFiInfo", "Failed to get AP protocol: %d", err);
        MATTER_TRACE_INSTANT("WiFi_Error", "ProtocolQueryFailed");
    }

    // Get bandwidth
    err = esp_wifi_get_bandwidth(WIFI_IF_STA, &bandwidth);
    if (err == ESP_OK)
    {
        const char * bandwidth_str = (bandwidth == WIFI_BW_HT20) ? "20MHz" : "40MHz";
        MATTER_TRACE_INSTANT("Bandwidth", bandwidth_str);
    }
    else
    {
        ESP_LOGE("LogWiFiInfo", "Failed to get bandwidth: %d", err);
        MATTER_TRACE_INSTANT("WiFi_Error", "BandwidthQueryFailed");
    }

    // Get power save type
    err = esp_wifi_get_ps(&ps_type);
    if (err == ESP_OK)
    {
        const char * ps_type_str;
        switch (ps_type)
        {
        case WIFI_PS_NONE:
            ps_type_str = "None";
            break;
        case WIFI_PS_MIN_MODEM:
            ps_type_str = "MinModem";
            break;
        case WIFI_PS_MAX_MODEM:
            ps_type_str = "MaxModem";
            break;
        default:
            ps_type_str = "Unknown";
            break;
        }
        MATTER_TRACE_INSTANT("Power_save_type", ps_type_str);
    }
    else
    {
        ESP_LOGE("LogWiFiInfo", "Failed to get power save type: %d", err);
        MATTER_TRACE_INSTANT("WiFi_Error", "PowerSaveQueryFailed");
    }

    // Get secondary channel
    err = esp_wifi_get_channel(NULL, &secondary_channel);
    if (err == ESP_OK)
    {
        const char * second_ch;
        switch (secondary_channel)
        {
        case WIFI_SECOND_CHAN_NONE:
            second_ch = "None";
            break;
        case WIFI_SECOND_CHAN_ABOVE:
            second_ch = "AbovePrimary";
            break;
        case WIFI_SECOND_CHAN_BELOW:
            second_ch = "BelowPrimary";
            break;
        default:
            second_ch = "Unknown";
            break;
        }
        MATTER_TRACE_INSTANT("Secondary_channel", second_ch);
    }
    else
    {
        ESP_LOGE("LogWiFiInfo", "Failed to get secondary channel: %d", esp_err_to_name(err));
        MATTER_TRACE_INSTANT("WiFi_Error", "ChannelQueryFailed");
    }
}
#endif // CONFIG_ENABLE_ESP_DIAGNOSTICS_TRACE

} // namespace DeviceLayer
} // namespace chip

#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFI
